{
   "10813": {
      "id": "10813",
      "ingredients": [
         "1 cup butter, softened",
         "1 cup white sugar",
         "1 cup packed brown sugar",
         "2 eggs",
         "2 teaspoons vanilla extract",
         "3 cups all-purpose flour",
         "1 teaspoon baking soda",
         "2 teaspoons hot water",
         "1/2 teaspoon salt",
         "2 cups semisweet chocolate chips",
         "1 cup chopped walnuts"
      ],
      "instructions": [
         "Preheat oven to 350 degrees F (175 degrees C).",
         "Cream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water.  Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans.",
         "Bake for about 10 minutes in the preheated oven, or until edges are nicely browned."
      ],
      "ready": 60,
      "tags": [
         "desserts",
         "everyday-cooking",
         "holidays-and-events",
         "ingredients"
      ]
   },
   "109190": {
      "id": "109190",
      "ingredients": [
         "1 pinch baking soda",
         "2 cups boiling water",
         "6 tea bags",
         "3/4 cup white sugar",
         "6 cups cool water"
      ],
      "instructions": [
         "Sprinkle a pinch of baking soda into a 64-ounce, heat-proof, glass pitcher. Pour in boiling water, and add tea bags. Cover, and allow to steep for 15 minutes.",
         "Remove tea bags, and discard; stir in sugar until dissolved. Pour in cool water, then refrigerate until cold."
      ],
      "ready": 200,
      "tags": [
         "drinks"
      ]
   },
   "112239": {
      "id": "112239",
      "ingredients": [
         "2 cups graham cracker crumbs",
         "1/2 cup butter, melted",
         "2 tablespoons white sugar",
         "3 (8 ounce) packages cream cheese, softened",
         "1 cup white sugar",
         "3 eggs",
         "1 (8 ounce) container sour cream",
         "1/4 cup brewed espresso or strong coffee",
         "2 teaspoons vanilla extract",
         "pressurized whipped cream",
         "caramel ice cream topping"
      ],
      "instructions": [
         "Preheat oven to 350 degrees F (175 degrees C).  Lightly coat a 9-inch springform pan with nonstick cooking spray.",
         "Mix together the graham cracker crumbs, melted butter, and 2 tablespoons of sugar until well combined.  Press into the bottom of the prepared springform pan, and 1 inch up the sides.  Bake in preheated oven for 8 minutes, then remove to cool on a wire rack.",
         "Reduce oven temperature to 325 degrees F (165 degrees C).",
         "Beat the softened cream cheese in a large bowl with an electric mixer until fluffy.  Gradually add 1 cup of sugar, beating until blended.   Add eggs one at a time, beating well after each addition.  Stir in sour cream, espresso and vanilla.  Pour batter into the baked and cooled crust.",
         "Bake cheesecake in the preheated oven for 1 hour and 5 minutes; then turn the oven off, partially open the door and allow the cheesecake to rest for 15 minutes more. Remove from the oven, and run a knife around the edges. Cool cheesecake on a wire rack to room temperature, then cover the springform pan with plastic wrap, and chill in the refrigerator for 8 hours.",
         "To serve, cut the cheesecake into wedges and garnish each slice with whipped cream and caramel sauce."
      ],
      "ready": 603,
      "tags": [
         "desserts"
      ]
   },
   "11688": {
      "id": "11688",
      "ingredients": [
         "2 cups heavy whipping cream",
         "1 tablespoon chopped fresh basil",
         "1 tablespoon chopped fresh thyme",
         "2 teaspoons salt",
         "2 teaspoons ground black pepper",
         "1 1/2 teaspoons crushed red pepper flakes",
         "1 teaspoon ground white pepper",
         "1 cup chopped green onions",
         "1 cup chopped parsley",
         "1/2 pound shrimp, peeled and deveined",
         "1/2 pound scallops",
         "1/2 cup shredded Swiss cheese",
         "1/2 cup grated Parmesan cheese",
         "1 pound dry fettuccine pasta"
      ],
      "instructions": [
         "Cook pasta in a large pot of boiling salted water until al dente.",
         "Meanwhile, pour cream into large skillet.  Cook over medium heat, stirring constantly, until just about boiling.  Reduce heat, and add herbs, salt, peppers, onions, and parsley.  Simmer 7 to 8 minutes, or until thickened.",
         "Stir in seafood, cooking until shrimp is no longer transparent. Stir in cheeses, blending well.",
         "Drain pasta.  Serve sauce over noodles."
      ],
      "ready": null,
      "tags": [
         "everyday-cooking"
      ]
   },
   "11731": {
      "id": "11731",
      "ingredients": [
         "1 (16 ounce) package linguini pasta",
         "1 pound cooked and peeled shrimp",
         "8 cloves crushed garlic",
         "2 (14.5 ounce) cans diced tomatoes",
         "1 (28 ounce) can crushed tomatoes with garlic",
         "2 teaspoons crushed red pepper flakes",
         "2 fluid ounces red wine (optional)"
      ],
      "instructions": [
         "Peel and cook shrimp if necessary, and place in a bowl of cold water.",
         "Place tomatoes, crushed garlic, red pepper flakes, and wine in a 3 quart sauce pan.  Simmer over low heat for 30 minutes, stirring occasionally.",
         "While sauce is simmering, cook linguini according to package directions.  When pasta is almost done, drain shrimp and place in the bottom of a large colander.  Drain the pasta over the shrimp. Transfer pasta with shrimp to a large serving bowl, and toss together with some sauce.  Serve remaining sauce on the side."
      ],
      "ready": null,
      "tags": [
         "pasta-and-noodles"
      ]
   },
   "12009": {
      "id": "12009",
      "ingredients": [
         "4 ounces linguine pasta",
         "2 boneless, skinless chicken breast halves, sliced into thin strips",
         "2 teaspoons Cajun seasoning",
         "2 tablespoons butter",
         "1 green bell pepper, chopped",
         "1/2 red bell pepper, chopped",
         "4 fresh mushrooms, sliced",
         "1 green onion, minced",
         "1 1/2 cups heavy cream",
         "1/4 teaspoon dried basil",
         "1/4 teaspoon lemon pepper",
         "1/4 teaspoon salt",
         "1/8 teaspoon garlic powder",
         "1/8 teaspoon ground black pepper",
         "2 tablespoons grated Parmesan cheese"
      ],
      "instructions": [
         "Bring a large pot of lightly salted water to a boil. Add linguini pasta, and cook for 8 to 10 minutes, or until al dente; drain.",
         "Meanwhile, place chicken and Cajun seasoning in a bowl, and toss to coat.",
         "In a large skillet over medium heat, saute chicken in butter until no longer pink and juices run clear, about 5 to 7 minutes. Add green and red bell peppers, sliced mushrooms and green onions; cook for 2 to 3 minutes. Reduce heat, and stir in heavy cream. Season the sauce with basil, lemon pepper, salt, garlic powder and ground black pepper, and heat through.",
         "In a large bowl, toss linguini with sauce. Sprinkle with grated Parmesan cheese."
      ],
      "ready": 30,
      "tags": [
         "pasta-and-noodles",
         "us-recipes"
      ]
   },
   "12409": {
      "id": "12409",
      "ingredients": [
         "10 cups all-purpose apples, peeled, cored and sliced",
         "1 cup white sugar",
         "1 tablespoon all-purpose flour",
         "1 teaspoon ground cinnamon",
         "1/2 cup water",
         "1 cup quick-cooking oats",
         "1 cup all-purpose flour",
         "1 cup packed brown sugar",
         "1/4 teaspoon baking powder",
         "1/4 teaspoon baking soda",
         "1/2 cup butter, melted"
      ],
      "instructions": [
         "Preheat oven to 350 degrees F (175 degree C).",
         "Place the sliced apples in a 9x13 inch pan. Mix the white sugar, 1 tablespoon flour and ground cinnamon together, and sprinkle over apples. Pour water evenly over all.",
         "Combine the oats, 1 cup flour, brown sugar, baking powder, baking soda and melted butter together. Crumble evenly over the apple mixture.",
         "Bake at 350 degrees F (175 degrees C) for about 45 minutes."
      ],
      "ready": 80,
      "tags": [
         "desserts",
         "fruits-and-vegetables",
         "ingredients"
      ]
   },
   "12720": {
      "id": "12720",
      "ingredients": [
         "1 1/2 pounds salmon fillets",
         "lemon pepper to taste",
         "garlic powder to taste",
         "salt to taste",
         "1/3 cup soy sauce",
         "1/3 cup brown sugar",
         "1/3 cup water",
         "1/4 cup vegetable oil"
      ],
      "instructions": [
         "Season salmon fillets with lemon pepper, garlic powder, and salt.",
         "In a small bowl, stir together soy sauce, brown sugar, water, and vegetable oil until sugar is dissolved. Place fish in a large resealable plastic bag with the soy sauce mixture, seal, and turn to coat. Refrigerate for at least 2 hours.",
         "Preheat grill for medium heat.",
         "Lightly oil grill grate. Place salmon on the preheated grill, and discard marinade. Cook salmon for 6 to 8 minutes per side, or until the fish flakes easily with a fork."
      ],
      "ready": 151,
      "tags": [
         "bbq-grilling",
         "dinner",
         "main-dish",
         "seafood"
      ]
   },
   "12974": {
      "id": "12974",
      "ingredients": [
         "6 tablespoons chopped onion",
         "4 tablespoons margarine",
         "6 cups peeled and cubed butternut squash",
         "3 cups water",
         "4 cubes chicken bouillon",
         "1/2 teaspoon dried marjoram",
         "1/4 teaspoon ground black pepper",
         "1/8 teaspoon ground cayenne pepper",
         "2 (8 ounce) packages cream cheese"
      ],
      "instructions": [
         "In a large saucepan, saute onions in margarine until tender. Add squash, water, bouillon, marjoram, black pepper and cayenne pepper. Bring to boil; cook 20 minutes, or until squash is tender.",
         "Puree squash and cream cheese in a blender or food processor in batches until smooth. Return to saucepan, and heat through. Do not allow to boil."
      ],
      "ready": 60,
      "tags": [
         "soups-stews-and-chili"
      ]
   },
   "14169": {
      "id": "14169",
      "ingredients": [
         "1 (15 ounce) can black beans, rinsed and drained",
         "1 (15 ounce) can kidney beans, drained",
         "1 (15 ounce) can cannellini beans, drained and rinsed",
         "1 green bell pepper, chopped",
         "1 red bell pepper, chopped",
         "1 (10 ounce) package frozen corn kernels",
         "1 red onion, chopped",
         "1/2 cup olive oil",
         "1/2 cup red wine vinegar",
         "2 tablespoons fresh lime juice",
         "1 tablespoon lemon juice",
         "2 tablespoons white sugar",
         "1 tablespoon salt",
         "1 clove crushed garlic",
         "1/4 cup chopped fresh cilantro",
         "1/2 tablespoon ground cumin",
         "1/2 tablespoon ground black pepper",
         "1 dash hot pepper sauce",
         "1/2 teaspoon chili powder"
      ],
      "instructions": [
         "In a large bowl, combine beans, bell peppers, frozen corn, and red onion.",
         "In a small bowl, whisk together olive oil, red wine vinegar, lime juice, lemon juice, sugar, salt, garlic, cilantro, cumin, and black pepper.  Season to taste with hot sauce and chili powder.",
         "Pour olive oil dressing over vegetables; mix well.  Chill thoroughly, and serve cold."
      ],
      "ready": 75,
      "tags": [
         "salad"
      ]
   },
   "141828": {
      "id": "141828",
      "ingredients": [
         "1 cup uncooked white long-grain rice",
         "5 cups water",
         "1/2 cup milk",
         "1/2 tablespoon vanilla extract",
         "1/2 tablespoon ground cinnamon",
         "2/3 cup white sugar"
      ],
      "instructions": [
         "Pour the rice and water into the bowl of a blender; blend until the rice just begins to break up, about 1 minute. Let rice and water stand at room temperature for a minimum of 3 hours.",
         "Strain the rice water into a pitcher and discard the rice. Stir the milk, vanilla, cinnamon, and sugar into the rice water. Chill and stir before serving over ice."
      ],
      "ready": 190,
      "tags": [
         "drinks"
      ]
   },
   "14231": {
      "id": "14231",
      "ingredients": [
         "3 avocados - peeled, pitted, and mashed",
         "1 lime, juiced",
         "1 teaspoon salt",
         "1/2 cup diced onion",
         "3 tablespoons chopped fresh cilantro",
         "2 roma (plum) tomatoes, diced",
         "1 teaspoon minced garlic",
         "1 pinch ground cayenne pepper (optional)"
      ],
      "instructions": [
         "In a medium bowl, mash together the avocados, lime juice, and salt. Mix in onion, cilantro, tomatoes, and garlic. Stir in cayenne pepper. Refrigerate 1 hour for best flavor, or serve immediately."
      ],
      "ready": 10,
      "tags": [
         "appetizers-and-snacks",
         "fruits-and-vegetables",
         "holidays-and-events"
      ]
   },
   "14281": {
      "id": "14281",
      "ingredients": [
         "8 slices bacon",
         "2 heads fresh broccoli, chopped",
         "1 1/2 cups sharp Cheddar cheese, shredded",
         "1/2 large red onion, chopped",
         "1/4 cup red wine vinegar",
         "1/8 cup white sugar",
         "2 teaspoons ground black pepper",
         "1 teaspoon salt",
         "2/3 cup mayonnaise",
         "1 teaspoon fresh lemon juice"
      ],
      "instructions": [
         "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, and crumble.",
         "In a large bowl, combine broccoli, cheese, bacon and onion.",
         "Prepare the dressing in a small bowl by whisking together the red wine vinegar, sugar, pepper, salt, mayonnaise and lemon juice. Combine dressing with salad. Cover, and refrigerate until ready to serve."
      ],
      "ready": 30,
      "tags": [
         "salad"
      ]
   },
   "143667": {
      "id": "143667",
      "ingredients": [
         "1 cup butter, melted",
         "3 cups white sugar",
         "1 tablespoon vanilla extract",
         "4 eggs",
         "1 1/2 cups all-purpose flour",
         "1 cup unsweetened cocoa powder",
         "1 teaspoon salt",
         "1 cup semisweet chocolate chips"
      ],
      "instructions": [
         "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 baking dish.",
         "Combine the melted butter, sugar, and vanilla in a large bowl. Beat in the eggs, one at a time, mixing well after each, until thoroughly blended.",
         "Sift the flour, cocoa powder, and salt in a bowl. Gradually stir flour mixture into the egg mixture until blended. Stir in the chocolate morsels. Spread the batter evenly into the prepared baking dish.",
         "Bake in preheated oven until an inserted toothpick comes out clean, 35 to 40 minutes. Remove, and cool pan on wire rack before cutting."
      ],
      "ready": 50,
      "tags": [
         "desserts"
      ]
   },
   "14685": {
      "id": "14685",
      "ingredients": [
         "2 pounds beef stew meat, cut into 1 inch cubes",
         "1/4 cup all-purpose flour",
         "1/2 teaspoon salt",
         "1/2 teaspoon ground black pepper",
         "1 clove garlic, minced",
         "1 bay leaf",
         "1 teaspoon paprika",
         "1 teaspoon Worcestershire sauce",
         "1 onion, chopped",
         "1 1/2 cups beef broth",
         "3 potatoes, diced",
         "4 carrots, sliced",
         "1 stalk celery, chopped"
      ],
      "instructions": [
         "Place meat in slow cooker. In a small bowl mix together the flour, salt, and pepper; pour over meat, and stir to coat meat with flour mixture. Stir in the garlic, bay leaf, paprika, Worcestershire sauce, onion, beef broth, potatoes, carrots, and celery.",
         "Cover, and cook on Low setting for 10 to 12 hours, or on High setting for 4 to 6 hours."
      ],
      "ready": 740,
      "tags": [
         "soups-stews-and-chili"
      ]
   },
   "147103": {
      "id": "147103",
      "ingredients": [
         "8 eggs",
         "1/2 cup mayonnaise",
         "1 teaspoon prepared yellow mustard",
         "1/4 cup chopped green onion",
         "salt and pepper to taste",
         "1/4 teaspoon paprika"
      ],
      "instructions": [
         "Place egg in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.",
         "Place the chopped eggs in a bowl, and stir in the mayonnaise, mustard and green onion. Season with salt, pepper and paprika. Stir and serve on your favorite bread or crackers."
      ],
      "ready": 35,
      "tags": [
         "salad"
      ]
   },
   "14830": {
      "id": "14830",
      "ingredients": [
         "2 cups canned garbanzo beans, drained",
         "1/3 cup tahini",
         "1/4 cup lemon juice",
         "1 teaspoon salt",
         "2 cloves garlic, halved",
         "1 tablespoon olive oil",
         "1 pinch paprika",
         "1 teaspoon minced fresh parsley"
      ],
      "instructions": [
         "Place the garbanzo beans, tahini, lemon juice, salt and garlic in a blender or food processor. Blend until smooth. Transfer mixture to a serving bowl.",
         "Drizzle olive oil over the garbanzo bean mixture. Sprinkle with paprika and parsley."
      ],
      "ready": 10,
      "tags": [
         "appetizers-and-snacks"
      ]
   },
   "14939": {
      "id": "14939",
      "ingredients": [
         "1 pound bacon",
         "1 (16 ounce) package little smokie sausages",
         "1 cup brown sugar, or to taste"
      ],
      "instructions": [
         "Preheat oven to 350 degrees F (175 degrees C).",
         "Cut bacon into thirds and wrap each strip around a little sausage. Place the wrapped sausages on wooden skewers, several to a skewer. Arrange the skewers on a baking sheet and sprinkle them liberally with brown sugar.",
         "Bake until bacon is crisp and the brown sugar melted."
      ],
      "ready": 30,
      "tags": [
         "appetizers-and-snacks"
      ]
   },
   "162760": {
      "id": "162760",
      "ingredients": [
         "3/4 cup milk",
         "2 tablespoons white vinegar",
         "1 cup all-purpose flour",
         "2 tablespoons white sugar",
         "1 teaspoon baking powder",
         "1/2 teaspoon baking soda",
         "1/2 teaspoon salt",
         "1 egg",
         "2 tablespoons butter, melted",
         "cooking spray"
      ],
      "instructions": [
         "Combine milk with vinegar in a medium bowl and set aside for 5 minutes to \"sour\".",
         "Combine flour, sugar, baking powder, baking soda, and salt in a large mixing bowl. Whisk egg and butter into \"soured\" milk. Pour the flour mixture into the wet ingredients and whisk until lumps are gone.",
         "Heat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side."
      ],
      "ready": 25,
      "tags": [
         "breakfast-and-brunch",
         "everyday-cooking",
         "holidays-and-events"
      ]
   },
   "16427": {
      "id": "16427",
      "ingredients": [
         "3 cups water",
         "1 teaspoon salt",
         "1 teaspoon ground black pepper",
         "1 teaspoon dried oregano",
         "1 teaspoon dried basil",
         "1 teaspoon onion salt",
         "1 teaspoon dried parsley",
         "1 teaspoon garlic powder",
         "1 bay leaf",
         "1 (.7 ounce) package dry Italian-style salad dressing mix",
         "1 (5 pound) rump roast"
      ],
      "instructions": [
         "Combine water with salt, ground black pepper, oregano, basil, onion salt, parsley, garlic powder, bay leaf, and salad dressing mix in a saucepan. Stir well, and bring to a boil.",
         "Place roast in slow cooker, and pour salad dressing mixture over the meat.",
         "Cover, and cook on Low for 10 to 12 hours, or on High for 4 to 5 hours. When done, remove bay leaf, and shred meat with a fork."
      ],
      "ready": 735,
      "tags": [
         "us-recipes"
      ]
   },
   "16715": {
      "id": "16715",
      "ingredients": [
         "1 (19 ounce) can garbanzo beans, drained and rinsed",
         "1 stalk celery, chopped",
         "1/2 onion, chopped",
         "1 tablespoon mayonnaise",
         "1 tablespoon lemon juice",
         "1 teaspoon dried dill weed",
         "salt and pepper to taste"
      ],
      "instructions": [
         "Drain and rinse chickpeas. Pour chickpeas into a medium size mixing bowl and mash with a fork. Mix in celery, onion, mayonnaise (to taste), lemon juice, dill, salt and pepper to taste."
      ],
      "ready": 20,
      "tags": [
         "lunch"
      ]
   },
   "16872": {
      "id": "16872",
      "ingredients": [
         "1 cup butter, softened",
         "1 1/2 cups brown sugar",
         "2 eggs",
         "2 teaspoons vanilla extract",
         "2 1/2 cups all-purpose flour",
         "1 teaspoon baking powder",
         "1/4 teaspoon salt",
         "1 cup milk chocolate chips",
         "1/2 cup semisweet chocolate chips",
         "2/3 cup toffee baking bits",
         "1 cup chopped pecans"
      ],
      "instructions": [
         "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.",
         "In a medium bowl, cream together the butter and sugar. Beat in eggs, one at a time, then stir in the vanilla. Combine the flour, baking powder, and salt; stir into the creamed mixture. Stir in the milk chocolate and semisweet chips, toffee bits, and pecans. Drop by tablespoonfuls onto cookie sheets.",
         "Bake for 10 to 12 minutes in the preheated oven. Allow cookies to cool on the baking sheet before transferring to wire racks to cool completely."
      ],
      "ready": 25,
      "tags": [
         "us-recipes"
      ]
   },
   "16955": {
      "id": "16955",
      "ingredients": [
         "1 1/2 cups cornmeal",
         "2 1/2 cups milk",
         "2 cups all-purpose flour",
         "1 tablespoon baking powder",
         "1 teaspoon salt",
         "2/3 cup white sugar",
         "2 eggs",
         "1/2 cup vegetable oil"
      ],
      "instructions": [
         "Preheat oven to 400 degrees F (200 degrees C). In a small bowl, combine cornmeal and milk; let stand for 5 minutes. Grease a 9x13 inch baking pan.",
         "In a large bowl, whisk together flour, baking powder, salt and sugar. Mix in the cornmeal mixture, eggs and oil until smooth. Pour batter into prepared pan.",
         "Bake in preheated oven for 30 to 35 minutes, or until a knife inserted into the center of the cornbread comes out clean."
      ],
      "ready": 50,
      "tags": [
         "bread"
      ]
   },
   "18781": {
      "id": "18781",
      "ingredients": [
         "2 cups uncooked egg noodles",
         "1/2 pound lean ground beef",
         "1 onion, chopped",
         "2 cloves garlic, minced",
         "1 green bell pepper, chopped",
         "1 cup sliced pepperoni sausage",
         "16 ounces pizza sauce",
         "4 tablespoons milk",
         "1 cup shredded mozzarella cheese"
      ],
      "instructions": [
         "Cook noodles according to package directions.",
         "Preheat oven to 350 degrees F (175 degrees C).",
         "In a medium skillet over medium-high heat, brown the ground beef with the onion, garlic and green bell pepper. Drain excess fat. Stir in the noodles, pepperoni, pizza sauce and milk, and mix well. Pour this mixture into a 2-quart casserole dish.",
         "Bake at 350 degrees F (175 degrees C) for 20 minutes, top with the cheese, then bake for 5 to 10 more minutes."
      ],
      "ready": 60,
      "tags": [
         "pasta-and-noodles"
      ]
   },
   "19163": {
      "id": "19163",
      "ingredients": [
         "2 1/2 cups white sugar",
         "6 cups water",
         "2 (3 ounce) packages strawberry flavored Jell-O® mix",
         "1 (46 fluid ounce) can pineapple juice",
         "2/3 cup lemon juice",
         "1 quart orange juice",
         "2 (2 liter) bottles lemon-lime flavored carbonated beverage"
      ],
      "instructions": [
         "Bring the sugar, water, and strawberry flavored gelatin to a boil in a large saucepan; boil for 3 minutes. Stir in the pineapple juice, lemon juice, and orange juice. Divide mixture into 2 separate containers and freeze.",
         "Combine the contents of 1 container with 1 bottle of the lemon-lime flavored carbonated beverage in a punch bowl; stir until slushy. Repeat with remaining portions as needed."
      ],
      "ready": 500,
      "tags": [
         "drinks"
      ]
   },
   "19673": {
      "id": "19673",
      "ingredients": [
         "1 (1 ounce) package taco seasoning mix",
         "1 (16 ounce) can refried beans",
         "1 (8 ounce) package cream cheese, softened",
         "1 (16 ounce) container sour cream",
         "1 (16 ounce) jar salsa",
         "1 large tomato, chopped",
         "1 green bell pepper, chopped",
         "1 bunch chopped green onions",
         "1 small head iceberg lettuce, shredded",
         "1 (6 ounce) can sliced black olives, drained",
         "2 cups shredded Cheddar cheese"
      ],
      "instructions": [
         "In a medium bowl, blend the taco seasoning mix and refried beans. Spread the mixture onto a large serving platter.",
         "Mix the sour cream and cream cheese in a medium bowl. Spread over the refried beans.",
         "Top the layers with salsa. Place a layer of tomato, green bell pepper, green onions and lettuce over the salsa, and top with Cheddar cheese. Garnish with black olives."
      ],
      "ready": 30,
      "tags": [
         "appetizers-and-snacks"
      ]
   },
   "200165": {
      "id": "200165",
      "ingredients": [
         "10 unpeeled red potatoes",
         "5 hard boiled eggs, roughly chopped",
         "3/4 cup sour cream",
         "3/4 cup mayonnaise",
         "1 tablespoon apple cider vinegar, or to taste",
         "1 tablespoon Dijon mustard, or to taste",
         "1/2 white onion, finely chopped",
         "1 stalk celery, finely chopped",
         "1 teaspoon celery salt",
         "salt and black pepper to taste",
         "1 tablespoon dried dill weed"
      ],
      "instructions": [
         "Place the potatoes in a large pot, cover them with water, and bring to a boil over high heat. Reduce the heat to medium-low, and simmer until the potatoes are cooked through but still firm, about 20 minutes. Remove from the water, let cool, and cut the potatoes into chunks. Set the potatoes aside.",
         "In a bowl, stir together the sour cream, mayonnaise, apple cider vinegar, Dijon mustard, onion, celery, celery salt, and salt and pepper until well mixed.",
         "Place the potatoes and eggs in a large salad bowl, and sprinkle with dried dill. Pour the dressing over the potatoes and eggs, and mix lightly. Cover and refrigerate the salad for at least 30 minutes. Serve cold."
      ],
      "ready": 70,
      "tags": [
         "lunch"
      ]
   },
   "20211": {
      "id": "20211",
      "ingredients": [
         "1/3 cup unsweetened cocoa powder",
         "3/4 cup white sugar",
         "1 pinch salt",
         "1/3 cup boiling water",
         "3 1/2 cups milk",
         "3/4 teaspoon vanilla extract",
         "1/2 cup half-and-half cream"
      ],
      "instructions": [
         "Combine the cocoa, sugar and pinch of salt in a saucepan.  Blend in the boiling water.  Bring this mixture to an easy boil while you stir.  Simmer and stir for about 2 minutes.  Watch that it doesn't scorch.  Stir in 3 1/2 cups of milk and heat until very hot, but do not boil!  Remove from heat and add vanilla.  Divide between 4 mugs. Add the cream to the mugs of cocoa to cool it to drinking temperature."
      ],
      "ready": 7,
      "tags": [
         "drinks"
      ]
   },
   "20509": {
      "id": "20509",
      "ingredients": [
         "12 ounces goat cheese",
         "3 tablespoons olive oil",
         "1 cup oil-packed sun-dried tomatoes, drained and diced",
         "1 cup black olives, chopped",
         "4 tablespoons chopped fresh basil",
         "2 tablespoons chopped fresh rosemary",
         "3 cloves garlic, halved"
      ],
      "instructions": [
         "Slice goat cheese into one inch pieces and place in a single layer on a large platter. Sprinkle olive oil, sun-dried tomatoes, black olives, basil and rosemary over the cheese.",
         "Using toothpicks, insert the garlic cloves into the cheese throughout the mixture.",
         "Allow the mixture to marinate 6 hours, or overnight, in the refrigerator. Remove the toothpicks, and serve with sliced French bread."
      ],
      "ready": 380,
      "tags": [
         "appetizers-and-snacks"
      ]
   },
   "20580": {
      "id": "20580",
      "ingredients": [
         "1 (32 fluid ounce) bottle apple juice, chilled",
         "1 (12 fluid ounce) can frozen cranberry juice concentrate",
         "1 cup orange juice",
         "1 1/2 liters ginger ale",
         "1 apple"
      ],
      "instructions": [
         "In a large punch bowl, combine apple juice, cranberry juice concentrate and orange juice. Stir until dissolved, then slowly pour in the ginger ale.",
         "Thinly slice the apple vertically,  forming whole apple slices. Float apple slices on top of punch."
      ],
      "ready": 10,
      "tags": [
         "drinks"
      ]
   },
   "21261": {
      "id": "21261",
      "ingredients": [
         "4 cups sweet potato, cubed",
         "1/2 cup white sugar",
         "2 eggs, beaten",
         "1/2 teaspoon salt",
         "4 tablespoons butter, softened",
         "1/2 cup milk",
         "1/2 teaspoon vanilla extract",
         "1/2 cup packed brown sugar",
         "1/3 cup all-purpose flour",
         "3 tablespoons butter, softened",
         "1/2 cup chopped pecans"
      ],
      "instructions": [
         "Preheat oven to 325 degrees F (165 degrees C). Put sweet potatoes in a medium saucepan  with water to cover. Cook over medium high heat until tender; drain and mash.",
         "In a large bowl, mix together the sweet potatoes, white sugar, eggs, salt, butter, milk and vanilla extract. Mix until smooth. Transfer to a 9x13 inch baking dish.",
         "In medium bowl, mix the brown sugar and flour. Cut in the butter until the mixture is coarse. Stir in the pecans. Sprinkle the mixture over the sweet potato mixture.",
         "Bake in the preheated oven 30 minutes, or until the topping is lightly brown."
      ],
      "ready": 60,
      "tags": [
         "side-dish"
      ]
   },
   "214071": {
      "id": "214071",
      "ingredients": [
         "1 pound uncooked large shrimp, peeled and deveined",
         "1 (8 ounce) can (8 to 10 count) artichoke hearts in water, drained",
         "1/2 cup Italian seasoned bread crumbs",
         "1 tablespoon chopped fresh parsley",
         "1 lemon, juiced",
         "1/2 cup butter",
         "1 1/2 tablespoons minced garlic",
         "1 tablespoon finely shredded imported Romano cheese"
      ],
      "instructions": [
         "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13-inch baking dish.",
         "Arrange the shrimp in the bottom of the prepared baking dish. Gently squeeze any excess liquid from the artichoke hearts, break the hearts into quarters, and arrange in spaces between the shrimp. Sprinkle the bread crumbs and parsley over the shrimp and artichoke hearts; sprinkle lemon juice over the crumbs.",
         "Melt butter with garlic in a small saucepan over medium-low heat; drizzle the butter mixture over the bread crumbs. Sprinkle the top with Romano cheese.",
         "Bake in the preheated oven until the crumbs and cheese brown lightly and the shrimp turn opaque and orange-pink in color, 10 to 12 minutes. Serve hot."
      ],
      "ready": 35,
      "tags": [
         "ingredients"
      ]
   },
   "214167": {
      "id": "214167",
      "ingredients": [
         "2 fresh poblano chile peppers",
         "8 ounces bacon, chopped",
         "1 tablespoon bacon drippings",
         "2 pounds pork loin, cut into 1-inch cubes",
         "1 onion, diced",
         "10 cloves garlic, minced",
         "2 jalapeno peppers, seeded and diced",
         "1 teaspoon dried Mexican oregano",
         "2 teaspoons ground cumin",
         "1 teaspoon New Mexico chile powder",
         "1/4 teaspoon ground cloves",
         "1/2 teaspoon kosher salt",
         "1 bunch cilantro, chopped",
         "8 cups chicken stock",
         "1 (14.5 ounce) can mild red enchilada sauce",
         "2 (29 ounce) cans white hominy, rinsed and drained"
      ],
      "instructions": [
         "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil.  Place the poblano chiles cut-side-down onto the baking sheet.",
         "Cook under the preheated broiler until the skin of the peppers has blackened and blistered, about 5 minutes. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard. Dice the chiles.",
         "Cook and stir the bacon in a large pot over medium heat until it has released its fat and is beginning to crisp, about 5 minutes. Drain the bacon on a paper towel-lined plate, and discard all but 1 tablespoon of bacon grease from the pot. Increase the heat to medium-high, and add the pork loin cubes. Cook, stirring occasionally until browned on all sides, about 5 minutes. Remove the pork from the pot, and reduce the heat to medium. Stir in the onion and garlic; cook and stir until the onion has softened and is beginning to turn brown, about 5 minutes.",
         "Stir the roasted poblano chiles, jalapeno peppers, oregano, cumin, New Mexico chile powder, cloves, salt, and cilantro into the onions; cook for 1 minute. Pour in the chicken stock and enchilada sauce. Stir in the bacon and pork cubes, and bring to a simmer over medium-high heat. Reduce heat to medium-low, cover, and simmer 1 hour. Stir in the hominy, recover, and continue cooking 1 hour more until the pork is very tender."
      ],
      "ready": 190,
      "tags": [
         "soups-stews-and-chili"
      ]
   },
   "219076": {
      "id": "219076",
      "ingredients": [
         "Secret Chili Spice Mix:",
         "1/4 cup ancho chile powder",
         "1 tablespoon paprika",
         "1 tablespoon ground cumin",
         "2 1/2 teaspoons salt",
         "1 1/2 teaspoons ground dried chipotle pepper",
         "1 teaspoon dried oregano",
         "1 teaspoon unsweetened cocoa powder",
         "1 teaspoon ground black pepper",
         "1/4 teaspoon ground cayenne pepper",
         "1/8 teaspoon ground cinnamon",
         "1 tablespoon olive oil",
         "1 onion, chopped",
         "2 1/2 pounds ground turkey",
         "3 cloves garlic, minced",
         "1 cup tomato puree",
         "2 cups water",
         "2 (12 ounce) cans pinquito or pinto beans, drained and rinsed"
      ],
      "instructions": [
         "Mix the ancho chile powder, paprika, cumin, salt, chipotle pepper, oregano, cocoa powder, black pepper, cayenne pepper, and cinnamon in a bowl; set aside.",
         "Heat the olive oil in a large heavy pot over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the ground turkey and garlic. Cook and stir until turkey is no longer pink, breaking up any large chunks, 7 to 8 minutes. Stir in the spice mixture. Cook until fragrant, 3 to 4 minutes.",
         "Stir in the tomato puree and water. Bring to a simmer, then reduce heat to low. Cook until the turkey meat is broken down, about 1 hour. Stir in the beans, and continue to simmer until flavors have blended, 20 to 30 more minutes."
      ],
      "ready": 110,
      "tags": [
         "soups-stews-and-chili"
      ]
   },
   "220907": {
      "id": "220907",
      "ingredients": [
         "1 cup water",
         "1 pinch salt",
         "6 tablespoons grits",
         "2 tablespoons olive oil",
         "1/2 cup diced tasso ham",
         "2 tablespoons diced onion",
         "2 tablespoons diced green bell pepper",
         "20 medium shrimp, peeled and deveined",
         "1/4 cup white wine",
         "1 cup heavy whipping cream",
         "salt and ground black pepper to taste",
         "1 tablespoon chopped green onion, green parts only"
      ],
      "instructions": [
         "Bring water and 1 pinch of salt to a boil in a saucepan and slowly mix in the grits, stirring constantly. Reduce heat to low and simmer grits until tender and smooth, about 20 minutes; stir often. Set aside and keep warm.",
         "Heat olive oil in a large skillet over medium-high heat; cook and stir tasso ham until crisp. Stir in onion and green bell pepper and cook until onion is translucent, about 4 minutes. Lightly stir the shrimp with the vegetables and olive oil just until pink, 30 to 45 seconds; remove shrimp from pan and set aside.",
         "Pour white wine into the skillet and stir, dissolving any browned bits of food in the bottom of the skillet; slowly add the cream, reduce heat to low, and simmer until thickened, about 10 minutes. Season with salt and black pepper.",
         "Divide the grits onto 2 serving plates and line the edge of each plate with 10 shrimp. Pour cream sauce over grits and sprinkle each serving with chopped green onion tops."
      ],
      "ready": 40,
      "tags": [
         "us-recipes"
      ]
   },
   "221261": {
      "id": "221261",
      "ingredients": [
         "2 bananas, broken into chunks",
         "2 cups milk",
         "1/2 cup peanut butter",
         "2 tablespoons honey, or to taste",
         "2 cups ice cubes"
      ],
      "instructions": [
         "Place bananas, milk, peanut butter, honey, and ice cubes in a blender; blend until smooth, about 30 seconds."
      ],
      "ready": 5,
      "tags": [
         "drinks"
      ]
   },
   "233329": {
      "id": "233329",
      "ingredients": [
         "2 cups water",
         "1 cup pearl (Israeli) couscous",
         "1 tablespoon olive oil",
         "1/2 cup chopped yellow onion",
         "1 shallot, chopped",
         "6 cloves garlic, quartered",
         "1/2 cup golden raisins",
         "1/2 cup chopped oil-packed sun-dried tomatoes",
         "1/2 cup slivered almonds",
         "1/2 teaspoon kosher salt",
         "1/4 teaspoon ground black pepper",
         "3 tablespoons lemon juice",
         "1 tablespoon butter, softened"
      ],
      "instructions": [
         "Bring the water to a boil in a saucepan; stir couscous into the boiling water and cook until couscous absorbs all the water and is cooked through, 10 to 15 minutes.",
         "Heat olive oil in a skillet over medium-low heat; cook and stir onion, shallot, and garlic in the hot oil until onion is lightly browned, 15 to 20 minutes. Stir raisins, sun-dried tomatoes, and almonds into onion mixture; cook and stir until heated through, about 5 minutes.",
         "Stir couscous into onion-raisin mixture; cook and stir until heated through, about 5 minutes. Season couscous mixture with salt and pepper; add lemon juice. Remove skillet from heat and stir butter into couscous mixture."
      ],
      "ready": 45,
      "tags": [
         "side-dish"
      ]
   },
   "23720": {
      "id": "23720",
      "ingredients": [
         "1 egg white, lightly beaten",
         "1 tablespoon water",
         "3 cups pecan halves",
         "1/2 cup white sugar",
         "1/2 teaspoon salt",
         "1 teaspoon ground cinnamon",
         "1/2 teaspoon ground cloves",
         "1/2 teaspoon ground nutmeg"
      ],
      "instructions": [
         "Preheat oven to 350 degrees F (175 degrees C).  Line a baking sheet with aluminum foil.",
         "In a small bowl beat the egg white with the water.  Stir in the pecans, mixing until well moistened.",
         "In a small bowl, mix together sugar, salt, cinnamon, cloves and nutmeg.  Sprinkle over the moistened nuts.  Spread nuts on prepared pan.",
         "Bake in preheated oven for 30 minutes, stirring once or twice.  Be careful not to overcook and burn the nuts."
      ],
      "ready": 40,
      "tags": [
         "ingredients"
      ]
   },
   "23734": {
      "id": "23734",
      "ingredients": [
         "1 (750 milliliter) bottle dry white wine",
         "3/4 cup peach flavored vodka",
         "6 tablespoons frozen lemonade concentrate, thawed",
         "1/4 cup white sugar",
         "1 pound white peaches, pitted and sliced",
         "3/4 cup seedless red grapes, halved",
         "3/4 cup seedless green grapes, halved"
      ],
      "instructions": [
         "In a large pitcher, combine dry white wine, peach vodka, lemonade concentrate and sugar. Stir until sugar is dissolved. Add sliced peaches, red and green grapes.",
         "Refrigerate sangria until well chilled, at least 2 hours, or overnight to blend flavors. Serve over ice, and use a slotted spoon to include sliced peaches and grapes with each serving."
      ],
      "ready": 130,
      "tags": [
         "drinks"
      ]
   },
   "23847": {
      "id": "23847",
      "ingredients": [
         "1 (16 ounce) package angel hair pasta",
         "1/4 cup olive oil",
         "1/2 onion, chopped",
         "4 cloves garlic, minced",
         "2 cups roma (plum) tomatoes, diced",
         "2 tablespoons balsamic vinegar",
         "1 (10.75 ounce) can low-sodium chicken broth",
         "crushed red pepper to taste",
         "freshly ground black pepper to taste",
         "2 tablespoons chopped fresh basil",
         "1/4 cup grated Parmesan cheese"
      ],
      "instructions": [
         "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8  minutes or until al dente; drain.",
         "Pour olive oil in a large deep skillet over high-heat. Saute onions and garlic until lightly browned. Reduce heat to medium-high and add tomatoes, vinegar and chicken broth; simmer for about 8 minutes.",
         "Stir in red pepper, black pepper, basil and cooked pasta, tossing thoroughly with sauce. Simmer for about 5 more minutes and serve topped with grated cheese."
      ],
      "ready": 30,
      "tags": [
         "dinner"
      ]
   },
   "23852": {
      "id": "23852",
      "ingredients": [
         "4 cups chicken broth",
         "2 cups water",
         "2 cooked, boneless chicken breast halves, shredded",
         "1 (4.5 ounce) package quick cooking long grain and wild rice with seasoning packet",
         "1/2 teaspoon salt",
         "1/2 teaspoon ground black pepper",
         "3/4 cup all-purpose flour",
         "1/2 cup butter",
         "2 cups heavy cream"
      ],
      "instructions": [
         "In a large pot over medium heat, combine broth, water and chicken. Bring just to boiling, then stir in rice, reserving seasoning packet. Cover and remove from heat.",
         "In a small bowl, combine salt, pepper and flour. In a medium saucepan over medium heat, melt butter. Stir in contents of seasoning packet until mixture is bubbly. Reduce heat to low, then stir in flour mixture by tablespoons, to form a roux. Whisk in cream, a little at a time, until fully incorporated and smooth. Cook until thickened, 5 minutes.",
         "Stir cream mixture into broth and rice. Cook over medium heat until heated through, 10 to 15 minutes."
      ],
      "ready": 25,
      "tags": [
         "soups-stews-and-chili"
      ]
   },
   "239180": {
      "id": "239180",
      "ingredients": [
         "3 pounds potatoes, peeled and cut into thick wedges",
         "1/3 cup olive oil",
         "2 lemons, juiced",
         "2 teaspoons salt",
         "1 teaspoon oregano",
         "1/2 teaspoon ground black pepper",
         "3 cups chicken broth"
      ],
      "instructions": [
         "Preheat oven to 400 degrees F (200 degrees C).",
         "Put potato wedges into a large bowl. Drizzle olive oil and lemon juice over the wedges and toss to coat. Season potatoes with salt, oregano, and black pepper; toss again to coat.",
         "Spread potato wedges in a single layer in a 2 inch-deep pan. Pour chicken broth over the potatoes.",
         "Roast potatoes in preheated oven until tender and golden brown, about 1 hour."
      ],
      "ready": 75,
      "tags": [
         "side-dish"
      ]
   },
   "23971": {
      "id": "23971",
      "ingredients": [
         "1 cup butter",
         "2 cups sifted all-purpose flour",
         "1 cup sour cream",
         "1 cup butter, softened",
         "2 cups brown sugar",
         "1 1/2 cups chopped English walnuts, divided",
         "1 cup confectioners' sugar",
         "2 tablespoons water"
      ],
      "instructions": [
         "In a large bowl, cut 1 cup butter into flour until crumbly, leaving pea-sized chunks. Stir in sour cream, and mix well; dough will be very sticky. Form dough into a ball. Cover tightly, and refrigerate 8 hours, or overnight.",
         "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet. Prepare the filling by combining 1 cup butter, brown sugar, and 1 cup chopped walnuts.",
         "Divide dough into three equal parts; return two parts to the refrigerator to keep cold. Quickly form 1/3 of the dough into a rectangle, and flour lightly. On a heavily floured surface, roll out to approximately 12x17 inches. Position lengthwise on the work surface. Along the long edges of the dough rectangle, use a sharp knife to cut 4 inch long angled lines about 1/2 inch apart. Spoon 1/3 of the filling along the length of the rectangle's uncut center. Alternating from one side of the dough to the other, fold each 1/2 inch wide strip towards the center, crisscrossing the filling in a braid-like fashion. Lightly press together the ends of the strips to seal. Sprinkle with 1/3 of the remaining walnuts. Repeat with remaining ingredients to form 3 braided danishes. Arrange danishes on prepared baking sheet.",
         "Bake for 30 minutes in the preheated oven, or until golden brown. Cool for approximately 30 minutes. While the danishes are cooling, prepare the icing: mix confectioners sugar and water until smooth. Drizzle in fine streams over warm danishes."
      ],
      "ready": 795,
      "tags": [
         "breakfast-and-brunch"
      ]
   },
   "24059": {
      "id": "24059",
      "ingredients": [
         "3/4 cup uncooked white rice",
         "2 cups milk, divided",
         "1/3 cup white sugar",
         "1/4 teaspoon salt",
         "1 egg, beaten",
         "2/3 cup golden raisins",
         "1 tablespoon butter",
         "1/2 teaspoon vanilla extract"
      ],
      "instructions": [
         "Bring 1 1/2  cups water to a boil in a saucepan; stir rice into boiling water. Reduce heat to low, cover, and simmer for 20 minutes.",
         "In a clean saucepan, combine 1 1/2 cups cooked rice, 1 1/2 cups milk, sugar and salt. Cook over medium heat until thick and creamy, 15 to 20 minutes. Stir in remaining 1/2 cup milk, beaten egg, and raisins; cook 2 minutes more, stirring constantly. Remove from heat and stir in butter and vanilla."
      ],
      "ready": 45,
      "tags": [
         "desserts"
      ]
   },
   "241265": {
      "id": "241265",
      "ingredients": [
         "1 pound dried red kidney beans, rinsed",
         "2 quarts water",
         "1 Moroccan-style preserved lemon, or to taste",
         "1 tablespoon white sugar",
         "1 tablespoon freshly ground black pepper",
         "1 small red chile pepper, halved lengthwise",
         "1 bay leaf",
         "1 teaspoon garlic powder",
         "1 teaspoon anise seed"
      ],
      "instructions": [
         "Place kidney beans into a large container and cover with about 1 quart water; let stand 8 hours to overnight. Drain.",
         "Combine beans, 1 quart water, preserved lemon, sugar, black pepper, red chile pepper, bay leaf, garlic powder, and anise seed in a stockpot; bring to a boil. Reduce heat to low, cover stockpot, and simmer for 1 hour.",
         "Remove lemon, bay leaf, and red chile pepper from bean mixture. Mash about 10% of the beans against the sides of the stockpot using the back of a spoon. Cover stockpot and simmer for 45 minutes more.",
         "Remove cover from stockpot and simmer beans until beans are thickened and water is evaporated, about 15 minutes more."
      ],
      "ready": 610,
      "tags": [
         "side-dish"
      ]
   },
   "244205": {
      "id": "244205",
      "ingredients": [
         "2 pounds red potatoes",
         "2 tablespoons extra-virgin olive oil",
         "Dressing:",
         "1/2 cup extra-virgin olive oil",
         "1 tablespoon apple cider vinegar",
         "1 teaspoon kosher salt",
         "1 teaspoon ground black pepper",
         "1 clove garlic, chopped",
         "1/2 teaspoon white sugar",
         "6 slices cooked bacon, chopped",
         "4 green onions, chopped",
         "2 tablespoons minced fresh parsley"
      ],
      "instructions": [
         "Preheat grill for medium heat and lightly oil the grate.",
         "Place potatoes in a bowl; add 2 tablespoons olive oil and toss to coat.",
         "Cook on preheated grill until tender, about 30 minutes. Cool potatoes, 10 to 15 minutes; cut into quarters.",
         "Whisk 1/2 cup olive oil, vinegar, salt, black pepper, garlic, and sugar together in a bowl until dressing is smooth. Toss potatoes, bacon, green onions, and parsley with dressing in a bowl until evenly coated."
      ],
      "ready": 55,
      "tags": [
         "bbq-grilling"
      ]
   },
   "24445": {
      "id": "24445",
      "ingredients": [
         "1 cup butter, softened",
         "1 cup packed light brown sugar",
         "1/2 cup white sugar",
         "2 eggs",
         "2 teaspoons vanilla extract",
         "1 1/4 cups all-purpose flour",
         "1/2 teaspoon baking soda",
         "1 teaspoon salt",
         "3 cups quick-cooking oats",
         "1 cup chopped walnuts",
         "1 cup semisweet chocolate chips"
      ],
      "instructions": [
         "Preheat the oven to 325 degrees F (165 degrees C).",
         "In a large bowl, cream together the butter, brown sugar, and white sugar until smooth. Beat in eggs one at a time, then stir in vanilla. Combine the flour, baking soda, and salt; stir into the creamed mixture until just blended. Mix in the quick oats, walnuts, and chocolate chips. Drop by heaping spoonfuls onto ungreased baking sheets.",
         "Bake for 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely."
      ],
      "ready": 55,
      "tags": [
         "desserts"
      ]
   },
   "24517": {
      "id": "24517",
      "ingredients": [
         "1 cup all-purpose flour",
         "1 cup yellow cornmeal",
         "1/4 cup white sugar",
         "1 tablespoon baking powder",
         "1 cup heavy cream",
         "1/4 cup vegetable oil",
         "1/4 cup honey",
         "2 eggs, lightly beaten"
      ],
      "instructions": [
         "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x9 inch baking pan.",
         "In a large bowl, stir together flour, cornmeal, sugar and baking powder. Make a well in the center of the dry ingredients. Add the cream, oil, honey and eggs; stir to combine. Pour batter into prepared baking pan.",
         "Bake in preheated oven for 20 to 25 minutes, until a toothpick inserted into center of pan comes out clean."
      ],
      "ready": 34,
      "tags": [
         "bread"
      ]
   },
   "246097": {
      "id": "246097",
      "ingredients": [
         "2 sweet apples, chopped",
         "2 cups almond milk",
         "2 bananas",
         "1 tablespoon almond butter",
         "1 tablespoon coconut sugar",
         "1 tablespoon maca powder",
         "1 teaspoon spirulina powder",
         "1 teaspoon chlorella powder",
         "1 1/2 cups oats"
      ],
      "instructions": [
         "Place apples and almond milk in a blender; blend until smooth. Add bananas and blend. Add almond butter, coconut sugar, maca powder, spirulina powder, and chlorella powder and blend until smooth. Add oats and blend until smooth."
      ],
      "ready": 10,
      "tags": [
         "healthy-recipes"
      ]
   },
   "246292": {
      "id": "246292",
      "ingredients": [
         "2 fennel bulbs",
         "2 tablespoons olive oil, divided",
         "1/2 teaspoon ground black pepper",
         "1/4 teaspoon salt",
         "1 tablespoon chopped fresh basil",
         "1 tablespoon chopped fresh parsley",
         "1 lemon, juiced",
         "1 teaspoon lemon zest",
         "1/2 teaspoon freshly ground black pepper",
         "1 pinch dried thyme",
         "2 tablespoons grated Parmesan cheese"
      ],
      "instructions": [
         "Preheat an outdoor grill for high heat and lightly oil the grate.",
         "Slice a very thin layer from the bottom of each fennel bulb using a vegetable peeler or paring knife, leaving the core in place to help hold bulb intact. Remove fennel stalks, reserving fronds. Slice bulbs vertically into 1/4-inch slices. Brush slices with 1 tablespoon olive oil and sprinkle with ground black pepper and salt on each side.",
         "Grill fennel slices until charred, about 5 minutes per side; transfer to serving platter.",
         "Whisk remaining 1 tablespoon olive oil, basil, parsley, lemon juice, lemon zest, freshly ground black pepper, thyme, and reserved fennel fronds together in a bowl. Sprinkle Parmesan cheese and drizzle lemon mixture over fennel."
      ],
      "ready": 25,
      "tags": [
         "bbq-grilling"
      ]
   },
   "247275": {
      "id": "247275",
      "ingredients": [
         "16 chicken wings, tips discarded",
         "1/4 cup olive oil",
         "1/4 cup dry rub for chicken (such as McCormick® Grill Mates®)",
         "1 pound mesquite wood chips, soaked in water",
         "1 (8 ounce) bottle blue cheese salad dressing"
      ],
      "instructions": [
         "Place chicken wings in a large bowl. Pour in olive oil; toss with hands until coated. Coat wings evenly with dry rub.",
         "Light charcoal and heat smoker to 170 to 200 degrees F (77 to 93 degrees C) according to manufacturer's instructions.",
         "Drain wood chips and place half of them directly on the charcoal. Spread wings evenly on the cooking grate skin-side down.",
         "Smoke wings until fragrant, about 1 hour.",
         "Flip wings. Add remaining wood chips to the charcoal. Continue smoking until an instant-read thermometer inserted near the bone reads 165 degrees F (74 degrees C), about 1 hour more.",
         "Serve chicken wings with blue cheese dressing."
      ],
      "ready": 130,
      "tags": [
         "bbq-grilling"
      ]
   },
   "25155": {
      "id": "25155",
      "ingredients": [
         "2 pounds clean, scrubbed new red potatoes",
         "6 eggs",
         "1 pound bacon",
         "1 onion, finely chopped",
         "1 stalk celery, finely chopped",
         "2 cups mayonnaise",
         "salt and pepper to taste"
      ],
      "instructions": [
         "Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain and set in the refrigerator to cool.",
         "Place eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.",
         "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.",
         "Chop the cooled potatoes, leaving skin on. Add to a large bowl, along with the eggs, bacon, onion and celery. Add mayonnaise, salt and pepper to taste. Chill for an hour before serving."
      ],
      "ready": 120,
      "tags": [
         "salad"
      ]
   },
   "254445": {
      "id": "254445",
      "ingredients": [
         "1 pound tomatoes",
         "1/4 cup olive oil, divided",
         "1 teaspoon salt, divided",
         "1 red bell pepper",
         "1 small onion, quartered",
         "1 poblano pepper",
         "3 cloves garlic, unpeeled",
         "1 lemon, halved",
         "1 1/2 teaspoons grated fresh horseradish",
         "1 teaspoon seafood seasoning (such as Old Bay®)",
         "1/2 teaspoon celery salt",
         "1 dash Worcestershire sauce",
         "1 dash hot sauce (such as Tabasco®), or to taste (optional)",
         "ice",
         "6 fluid ounces vodka, divided"
      ],
      "instructions": [
         "Preheat grill for medium heat and lightly oil the grate.",
         "Toss tomatoes with 2 tablespoons olive oil and 1/2 teaspoon salt in a bowl. Place on 2 sheets of aluminum foil; tent the edges to contain the juices.",
         "Toss red bell pepper, onion, poblano pepper, and garlic with remaining 2 tablespoons olive oil and 1/2 teaspoon salt in the bowl.",
         "Place tented aluminum foil with tomatoes on the grill. Place red bell pepper mixture and lemon halves directly on the grill. Cover and cook, turning occasionally, until browned, 12 to 15 minutes.",
         "Wrap grilled red bell pepper and poblano pepper in aluminum foil. Allow peppers to steam as they cool, about 10 minutes. Remove and discard skins and seeds.",
         "Transfer peeled peppers to a blender. Add grilled tomatoes, with their juices, and 3/4 of the onion to the blender. Squeeze in juice from grilled lemon and garlic from the skins. Cover and blend until smooth. Stir in horseradish, seafood seasoning, celery salt, Worcestershire sauce, and hot sauce. Refrigerate until cooled, about 30 minutes.",
         "Fill 6 glasses with ice. Pour 1 fluid ounce vodka into each. Top with blended mixture. Garnish with remaining 1/4 onion."
      ],
      "ready": 72,
      "tags": [
         "bbq-grilling"
      ]
   },
   "255899": {
      "id": "255899",
      "ingredients": [
         "2 tablespoons butter",
         "2 yellow onions, sliced",
         "4 skinless, boneless chicken breast halves",
         "4 Borden® Gouda Cheese Slices, or more as needed",
         "1 (4.75 ounce) package seasoned coating mix for chicken"
      ],
      "instructions": [
         "Melt butter in a skillet over medium-low heat. Add onions and saute until golden brown, stirring frequently. Continue cooking over medium-low heat until onions turn deeper brown, 35 to 45 minutes. If they start to burn, reduce heat. When completely caramelized, remove skillet from heat.",
         "Preheat oven to 400 degrees F (200 degrees C). Line a rimmed baking sheet with aluminum foil.",
         "Cut a pocket into the side of each chicken breast. Evenly stuff pockets with 1 or 2 slices of Gouda cheese (depending on size of breast) and 1 tablespoon caramelized onions.",
         "Place seasoned coating mix in a shallow dish. Evenly dip each chicken breast in coating mix and place on prepared baking sheet.",
         "Bake in preheated oven until chicken breasts are no longer pink in the center and the juices run clear, 20 to 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C)."
      ],
      "ready": 75,
      "tags": [
         "main-dish",
         "meat-and-poultry"
      ]
   },
   "257466": {
      "id": "257466",
      "ingredients": [
         "6 ounces Barilla® Spaghetti",
         "1 (6.3 ounce) jar Barilla® Pesto",
         "2 teaspoons salt",
         "5 ounces fresh green beans, trimmed",
         "1 extra large zucchini, spiralized",
         "1 tablespoon extra-virgin olive oil",
         "1/4 cup grated Parmesan cheese",
         "1 tablespoon red pepper flakes (optional)",
         "2 teaspoons toasted pine nuts"
      ],
      "instructions": [
         "Bring a large pot of water to a boil over high heat. Add salt and green beans. Simmer 1 minute. Add spaghetti and continue cooking over medium to medium-high heat, stirring occasionally, 8 minutes. Reduce heat to medium; add spiralized zucchini. Stir gently and continue simmering until spaghetti is tender yet firm to the bite, 2 or 3 minutes. Reserve about 1/2 cup cooking water. Drain the spaghetti and vegetables.",
         "Heat pesto in a pot over medium-low heat; add a few tablespoons of cooking water to thin slightly; stir. Transfer drained spaghetti and vegetables to pot; mix gently to coat with the sauce.",
         "Transfer spaghetti to a warmed serving bowl. Drizzle with olive oil; top with grated cheese, red pepper flakes, and pine nuts."
      ],
      "ready": 25,
      "tags": [
         "main-dish"
      ]
   },
   "258817": {
      "id": "258817",
      "ingredients": [
         "2 cups penne pasta",
         "1 (6 ounce) jar marinated artichokes, coarsely chopped, marinade reserved",
         "3 skinless, boneless chicken breasts, cut into bite-sized pieces",
         "3 cups sliced fresh mushrooms",
         "3/4 cup reduced-fat low-sodium chicken broth",
         "1/2 cup dry white wine",
         "1 tablespoon cornstarch",
         "salt and ground black pepper to taste"
      ],
      "instructions": [
         "Bring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain.",
         "Pour artichoke marinade into a large nonstick skillet over medium heat. Add chicken; cook and stir until white, about 3 minutes. Add mushrooms; cook and stir until chicken is no longer pink in the center, 4 to 6 minutes. Stir in artichokes.",
         "Mix chicken broth, white wine, and cornstarch together in a bowl until cornstarch is dissolved. Pour into the skillet slowly, stirring constantly until sauce comes to a boil. Reduce heat and simmer until thickened, about 5 minutes.",
         "Toss chicken mixture with penne in a large bowl. Season with salt and pepper."
      ],
      "ready": 48,
      "tags": [
         "main-dish"
      ]
   },
   "30522": {
      "id": "30522",
      "ingredients": [
         "1/4 cup cider vinegar",
         "3 tablespoons prepared coarse-ground mustard",
         "3 cloves garlic, peeled and minced",
         "1 lime, juiced",
         "1/2 lemon, juiced",
         "1/2 cup brown sugar",
         "1 1/2 teaspoons salt",
         "ground black pepper to taste",
         "6 tablespoons olive oil",
         "6 skinless, boneless chicken breast halves"
      ],
      "instructions": [
         "In a large glass bowl, mix the cider vinegar, mustard, garlic, lime juice, lemon juice, brown sugar, salt, and pepper. Whisk in the olive oil. Place chicken in the mixture. Cover, and marinate 8 hours, or overnight.",
         "Preheat an outdoor grill for high heat.",
         "Lightly oil the grill grate. Place chicken on the prepared grill, and cook 6 to 8 minutes per side, until juices run clear. Discard marinade."
      ],
      "ready": 540,
      "tags": [
         "bbq-grilling",
         "healthy-recipes"
      ]
   },
   "32649": {
      "id": "32649",
      "ingredients": [
         "1 (6 ounce) can frozen limeade concentrate",
         "6 fluid ounces tequila",
         "2 fluid ounces triple sec"
      ],
      "instructions": [
         "Fill blender with crushed ice. Pour in limeade concentrate, tequila and triple sec. Blend until smooth. Pour into glasses and serve."
      ],
      "ready": 5,
      "tags": [
         "drinks"
      ]
   },
   "42719": {
      "id": "42719",
      "ingredients": [
         "1 1/2 cups all-purpose flour",
         "1 teaspoon baking powder",
         "1 teaspoon baking soda",
         "1/2 teaspoon salt",
         "3 large bananas, mashed",
         "3/4 cup white sugar",
         "1 egg",
         "1/3 cup butter, melted"
      ],
      "instructions": [
         "Preheat oven to 350 degrees F (175 degrees C). Coat muffin pans with non-stick spray, or use paper liners. Sift together the flour, baking powder, baking soda, and salt; set aside.",
         "Combine bananas, sugar, egg, and melted butter in a large bowl. Fold in flour mixture, and mix until smooth. Scoop into muffin pans.",
         "Bake in preheated oven. Bake mini muffins for 10 to 15 minutes, and large muffins for 25 to 30 minutes. Muffins will spring back when lightly tapped."
      ],
      "ready": 35,
      "tags": [
         "bread"
      ]
   },
   "45954": {
      "id": "45954",
      "ingredients": [
         "4 teaspoons salt",
         "2 teaspoons paprika",
         "1 teaspoon onion powder",
         "1 teaspoon dried thyme",
         "1 teaspoon white pepper",
         "1/2 teaspoon cayenne pepper",
         "1/2 teaspoon black pepper",
         "1/2 teaspoon garlic powder",
         "2 onions, quartered",
         "2 (4 pound) whole chickens"
      ],
      "instructions": [
         "In a small bowl, mix together salt, paprika, onion powder, thyme, white pepper, black pepper, cayenne pepper, and garlic powder. Remove and discard giblets from chicken. Rinse chicken cavity, and pat dry with paper towel. Rub each chicken inside and out with spice mixture. Place 1 onion into the cavity of each chicken. Place chickens in a resealable bag or double wrap with plastic wrap. Refrigerate overnight, or at least 4 to 6 hours.",
         "Preheat oven to 250 degrees F (120 degrees C).",
         "Place chickens in a roasting pan. Bake uncovered for 5 hours, to a minimum internal temperature of 180 degrees F (85 degrees C). Let the chickens stand for 10 minutes before carving."
      ],
      "ready": 550,
      "tags": [
         "dinner",
         "us-recipes"
      ]
   },
   "49552": {
      "id": "49552",
      "ingredients": [
         "1 teaspoon vegetable oil",
         "1 onion, chopped",
         "3 cloves garlic, chopped",
         "3/4 cup quinoa",
         "1 1/2 cups vegetable broth",
         "1 teaspoon ground cumin",
         "1/4 teaspoon cayenne pepper",
         "salt and ground black pepper to taste",
         "1 cup frozen corn kernels",
         "2 (15 ounce) cans black beans, rinsed and drained",
         "1/2 cup chopped fresh cilantro"
      ],
      "instructions": [
         "Heat oil in a saucepan over medium heat; cook and stir onion and garlic until lightly browned, about 10 minutes.",
         "Mix quinoa into onion mixture and cover with vegetable broth; season with cumin, cayenne pepper, salt, and pepper. Bring the mixture to a boil. Cover, reduce heat, and simmer until quinoa is tender and broth is absorbed, about 20 minutes.",
         "Stir frozen corn into the saucepan, and continue to simmer until heated through, about 5 minutes; mix in the black beans and cilantro."
      ],
      "ready": 50,
      "tags": [
         "fruits-and-vegetables",
         "healthy-recipes",
         "side-dish",
         "world-cuisine"
      ]
   },
   "6698": {
      "id": "6698",
      "ingredients": [
         "3 cups all-purpose flour",
         "1 teaspoon salt",
         "1 teaspoon baking soda",
         "1 teaspoon baking powder",
         "1 tablespoon ground cinnamon",
         "3 eggs",
         "1 cup vegetable oil",
         "2 1/4 cups white sugar",
         "3 teaspoons vanilla extract",
         "2 cups grated zucchini",
         "1 cup chopped walnuts"
      ],
      "instructions": [
         "Grease and flour two 8 x 4 inch pans.  Preheat oven to 325 degrees F (165 degrees C).",
         "Sift flour, salt, baking powder, soda, and cinnamon together in a bowl.",
         "Beat eggs, oil, vanilla, and sugar together in a large bowl.  Add sifted ingredients to the creamed mixture, and beat well.  Stir in zucchini and nuts until well combined.  Pour batter into prepared pans.",
         "Bake for 40 to 60 minutes, or until tester inserted in the center comes out clean.  Cool in pan on rack for 20 minutes.  Remove bread from pan, and completely cool."
      ],
      "ready": 100,
      "tags": [
         "bread",
         "breakfast-and-brunch",
         "everyday-cooking",
         "fruits-and-vegetables",
         "holidays-and-events",
         "ingredients"
      ]
   },
   "6773": {
      "id": "6773",
      "ingredients": [
         "3 cups warm water (110 degrees F/45 degrees C)",
         "2 (.25 ounce) packages active dry yeast",
         "1/3 cup honey",
         "5 cups bread flour",
         "3 tablespoons butter, melted",
         "1/3 cup honey",
         "1 tablespoon salt",
         "3 1/2 cups whole wheat flour",
         "2 tablespoons butter, melted"
      ],
      "instructions": [
         "In a large bowl, mix warm water, yeast, and 1/3 cup honey.  Add 5 cups white bread flour, and stir to combine.  Let set for 30 minutes, or until big and bubbly.",
         "Mix in 3 tablespoons melted butter, 1/3 cup honey, and salt.  Stir in 2 cups whole wheat flour.  Flour a flat surface and knead with whole wheat flour until not real sticky - just pulling away from the counter, but still sticky to touch.  This may take an additional 2 to 4 cups of whole wheat flour.  Place in a greased bowl, turning once to coat the surface of the dough.  Cover with a dishtowel.  Let rise in a warm place until doubled.",
         "Punch down, and divide into 3 loaves.  Place in greased 9 x 5 inch loaf pans, and allow to rise until dough has topped the pans by one inch.",
         "Bake at 350 degrees F (175 degrees C) for 25 to 30 minutes; do not overbake.  Lightly brush the tops of loaves with 2 tablespoons melted butter or margarine when done to prevent crust from getting hard.  Cool completely"
      ],
      "ready": 180,
      "tags": [
         "healthy-recipes"
      ]
   },
   "68461": {
      "id": "68461",
      "ingredients": [
         "2 (10 ounce) cans chunk chicken, drained",
         "2 (8 ounce) packages cream cheese, softened",
         "1 cup Ranch dressing",
         "3/4 cup pepper sauce (such as Frank's Red Hot®)",
         "1 1/2 cups shredded Cheddar cheese",
         "1 bunch celery, cleaned and cut into 4 inch pieces",
         "1 (8 ounce) box chicken-flavored crackers"
      ],
      "instructions": [
         "Heat chicken and hot sauce in a skillet over medium heat, until heated through. Stir in cream cheese and ranch dressing. Cook, stirring until well blended and warm. Mix in half of the shredded cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over the top, cover, and cook on Low setting until hot and bubbly. Serve with celery sticks and crackers."
      ],
      "ready": 45,
      "tags": [
         "appetizers-and-snacks",
         "meat-and-poultry",
         "us-recipes"
      ]
   },
   "69984": {
      "id": "69984",
      "ingredients": [
         "2 cups butter, softened",
         "2 teaspoons vanilla extract",
         "2 cups confectioners' sugar",
         "1/4 teaspoon salt",
         "4 1/2 cups sifted all-purpose flour",
         "1/2 cup chopped walnuts",
         "1/2 cup chopped maraschino cherries"
      ],
      "instructions": [
         "Preheat the oven to 350 degrees F (175 degrees C).",
         "In a large bowl, mix together the butter, vanilla and confectioners' sugar until smooth. Mix in salt, then stir in flour by hand until dough is stiff. Add the walnuts and cherries, and mix into the dough, kneading like bread on a clean floured surface.",
         "Roll dough into ping pong sized balls, and place onto ungreased cookie sheets. Press down balls with a fork to make a criss cross pattern on top.",
         "Bake for 15 to 17 minutes in the preheated oven. Let stand on the baking sheet for a few minutes before removing to wire racks to cool completely."
      ],
      "ready": 30,
      "tags": [
         "us-recipes"
      ]
   },
   "70163": {
      "id": "70163",
      "ingredients": [
         "4 (4 ounce) fillets tilapia",
         "2 teaspoons butter",
         "1/4 teaspoon Old Bay Seasoning TM, or to taste",
         "1/2 teaspoon garlic salt, or to taste",
         "1 lemon, sliced",
         "1 (16 ounce) package frozen cauliflower with broccoli and red pepper"
      ],
      "instructions": [
         "Preheat the oven to 375 degrees F (190 degrees F). Grease a 9x13 inch baking dish.",
         "Place the tilapia fillets in the bottom of the baking dish and dot with butter. Season with Old Bay seasoning and garlic salt. Top each one with a slice or two of lemon. Arrange the frozen mixed vegetables around the fish, and season lightly with salt and pepper.",
         "Cover the dish and bake for 25 to 30 minutes in the preheated oven, until vegetables are tender and fish flakes easily with a fork."
      ],
      "ready": 35,
      "tags": [
         "healthy-recipes"
      ]
   },
   "70312": {
      "id": "70312",
      "ingredients": [
         "1 onion, peeled and halved",
         "3 cups dry pinto beans, rinsed",
         "1/2 fresh jalapeno pepper, seeded and chopped",
         "2 tablespoons minced garlic",
         "5 teaspoons salt",
         "1 3/4 teaspoons fresh ground black pepper",
         "1/8 teaspoon ground cumin, optional",
         "9 cups water"
      ],
      "instructions": [
         "Place the onion, rinsed beans, jalapeno, garlic, salt, pepper, and cumin into a slow cooker. Pour in the water and stir to combine.  Cook on High for 8 hours, adding more water as needed.  Note: if more than 1 cup of water has evaporated during cooking, then the temperature is too high.",
         "Once the beans have cooked, strain them, and reserve the liquid.  Mash the beans with a potato masher, adding the reserved water as needed to attain desired consistency."
      ],
      "ready": 495,
      "tags": [
         "healthy-recipes",
         "side-dish"
      ]
   },
   "7149": {
      "id": "7149",
      "ingredients": [
         "1/3 cup warm water (110 degrees F/45 degrees C)",
         "3 eggs",
         "2 egg yolks",
         "3/4 cup butter, softened",
         "3 1/3 cups all-purpose flour",
         "1/4 cup white sugar",
         "1/2 teaspoon active dry yeast",
         "1 egg white",
         "2 tablespoons water"
      ],
      "instructions": [
         "Place the first seven ingredients in bread machine in order suggested by your manufacturer. Select dough cycle.",
         "Turn finished dough out onto a lightly floured board and knead 5 to 10 times. Separate into 2 or 3 pieces. Roll with hands into strips. Braid or twist strips together. Place onto a parchment lined baking sheet. Set aside to rise in a warm place until doubled in size.",
         "Preheat the oven to 350 degrees F (175 degrees C). Whisk together 1 egg white and the water. Brush onto the top of the loaf.",
         "Bake in the preheated oven until deep golden brown, about 20 minutes."
      ],
      "ready": 155,
      "tags": [
         "bread"
      ]
   },
   "76129": {
      "id": "76129",
      "ingredients": [
         "1 (16 ounce) package cheese tortellini",
         "1 (14.5 ounce) can diced tomatoes with garlic and onion",
         "1 cup chopped fresh spinach",
         "1/2 teaspoon salt",
         "1/4 teaspoon pepper",
         "1 1/2 teaspoons dried basil",
         "1 teaspoon minced garlic",
         "2 tablespoons all-purpose flour",
         "3/4 cup milk",
         "3/4 cup heavy cream",
         "1/4 cup grated Parmesan cheese"
      ],
      "instructions": [
         "Bring a large pot of water to a boil. Add the tortellini, and cook until tender, about 10 minutes.",
         "While you get the tortellini going, combine the tomatoes, spinach, salt, pepper, basil and garlic in a large saucepan over medium heat. Cook and stir until the mixture begins to bubble.",
         "In a medium bowl, whisk together the flour, milk and cream. Stir this mixture into the saucepan along with the Parmesan cheese. Heat through, then reduce heat to low, and simmer until thick, about 2 minutes.",
         "Drain the tortellini, but do not rinse, then pour them into the saucepan with the sauce. Stir to coat, and serve."
      ],
      "ready": 40,
      "tags": [
         "pasta-and-noodles"
      ]
   },
   "78052": {
      "id": "78052",
      "ingredients": [
         "2 quarts vegetable broth",
         "1 cup uncooked barley",
         "2 large carrots, chopped",
         "2 stalks celery, chopped",
         "1 (14.5 ounce) can diced tomatoes with juice",
         "1 zucchini, chopped",
         "1 (15 ounce) can garbanzo beans, drained",
         "1 onion, chopped",
         "3 bay leaves",
         "1 teaspoon garlic powder",
         "1 teaspoon white sugar",
         "1 teaspoon salt",
         "1/2 teaspoon ground black pepper",
         "1 teaspoon dried parsley",
         "1 teaspoon curry powder",
         "1 teaspoon paprika",
         "1 teaspoon Worcestershire sauce"
      ],
      "instructions": [
         "Pour the vegetable broth into a large pot. Add the barley, carrots, celery, tomatoes, zucchini, garbanzo beans, onion, and bay leaves. Season with garlic powder, sugar, salt, pepper, parsley, curry powder, paprika, and Worcestershire sauce. Bring to a boil, then cover and simmer over medium-low heat for 90 minutes. The soup will be very thick. You may adjust by adding more broth or less barley if desired. Remove bay leaves before serving."
      ],
      "ready": 105,
      "tags": [
         "lunch"
      ]
   },
   "85452": {
      "id": "85452",
      "ingredients": [
         "1 (16 ounce) can black beans, drained and rinsed",
         "1/2 green bell pepper, cut into 2 inch pieces",
         "1/2 onion, cut into wedges",
         "3 cloves garlic, peeled",
         "1 egg",
         "1 tablespoon chili powder",
         "1 tablespoon cumin",
         "1 teaspoon Thai chili sauce or hot sauce",
         "1/2 cup bread crumbs"
      ],
      "instructions": [
         "If grilling, preheat an outdoor grill for high heat, and lightly oil a sheet of aluminum foil. If baking, preheat oven to 375 degrees F (190 degrees C), and lightly oil a baking sheet.",
         "In a medium bowl, mash black beans with a fork until thick and pasty.",
         "In a food processor, finely chop bell pepper, onion, and garlic. Then stir into mashed beans.",
         "In a small bowl, stir together egg, chili powder, cumin, and chili sauce.",
         "Stir the egg mixture into the mashed beans. Mix in bread crumbs until the mixture is sticky and holds together. Divide mixture into four patties.",
         "If grilling, place patties on foil, and grill about 8 minutes on each side. If baking, place patties on baking sheet, and bake about 10 minutes on each side."
      ],
      "ready": 35,
      "tags": [
         "bbq-grilling",
         "healthy-recipes",
         "us-recipes"
      ]
   },
   "86687": {
      "id": "86687",
      "ingredients": [
         "1 1/2 pounds fresh broccoli, cut into bite size pieces",
         "1/3 cup butter",
         "1 tablespoon brown sugar",
         "3 tablespoons soy sauce",
         "2 teaspoons white vinegar",
         "1/4 teaspoon ground black pepper",
         "2 cloves garlic, minced",
         "1/3 cup chopped salted cashews"
      ],
      "instructions": [
         "Place the broccoli into a large pot with about 1 inch of water in the bottom. Bring to a boil, and cook for 7 minutes, or until tender but still crisp. Drain, and arrange broccoli on a serving platter.",
         "While the broccoli is cooking, melt the butter in a small skillet over medium heat. Mix in the brown sugar, soy sauce, vinegar, pepper and garlic. Bring to a boil, then remove from the heat. Mix in the cashews, and pour the sauce over the broccoli. Serve immediately."
      ],
      "ready": 20,
      "tags": [
         "side-dish"
      ]
   },
   "8758": {
      "id": "8758",
      "ingredients": [
         "9 lasagna noodles",
         "1/2 cup butter",
         "1 onion, chopped",
         "1 clove garlic, minced",
         "1/2 cup all-purpose flour",
         "1 teaspoon salt",
         "2 cups chicken broth",
         "1 1/2 cups milk",
         "4 cups shredded mozzarella cheese, divided",
         "1 cup grated Parmesan cheese, divided",
         "1 teaspoon dried basil",
         "1 teaspoon dried oregano",
         "1/2 teaspoon ground black pepper",
         "2 cups ricotta cheese",
         "2 cups cubed, cooked chicken meat",
         "2 (10 ounce) packages frozen chopped spinach, thawed and drained",
         "1 tablespoon chopped fresh parsley",
         "1/4 cup grated Parmesan cheese for topping"
      ],
      "instructions": [
         "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain, and rinse with cold water.",
         "Melt the butter in a large saucepan over medium heat. Cook the onion and garlic in the butter until tender, stirring frequently. Stir in the flour and salt, and simmer until bubbly. Mix in the broth and milk, and boil, stirring constantly, for 1 minute. Stir in 2 cups mozzarella cheese and 1/4 cup Parmesan cheese. Season with the basil, oregano, and ground black pepper. Remove from heat, and set aside.",
         "Spread 1/3 of the sauce mixture in the bottom of a 9x13 inch baking dish. Layer with 1/3 of the noodles, the ricotta, and the chicken. Arrange 1/3 of the noodles over the chicken,  and layer with 1/3 of the sauce mixture, spinach, and the remaining 2 cups mozzarella cheese and 1/2 cup Parmesan cheese. Arrange remaining noodles over cheese, and spread remaining sauce evenly over noodles. Sprinkle with parsley and 1/4 cup Parmesan cheese.",
         "Bake 35 to 40 minutes in the preheated oven."
      ],
      "ready": 75,
      "tags": [
         "pasta-and-noodles"
      ]
   },
   "8941": {
      "id": "8941",
      "ingredients": [
         "4 skinless, boneless chicken breast halves",
         "2 tablespoons butter",
         "2 (10.75 ounce) cans condensed cream of chicken soup",
         "1 onion, finely diced",
         "2 (10 ounce) packages refrigerated biscuit dough, torn into pieces"
      ],
      "instructions": [
         "Place the chicken, butter, soup, and onion in a slow cooker, and fill with enough water to cover.",
         "Cover, and cook for 5 to 6 hours on High. About 30 minutes before serving, place the torn biscuit dough in the slow cooker. Cook until the dough is no longer raw in the center."
      ],
      "ready": 370,
      "tags": [
         "everyday-cooking",
         "main-dish",
         "meat-and-poultry",
         "soups-stews-and-chili"
      ]
   },
   "90500": {
      "id": "90500",
      "ingredients": [
         "4 medium beets - scrubbed, trimmed and cut in half",
         "1/3 cup chopped walnuts",
         "3 tablespoons maple syrup",
         "1 (10 ounce) package mixed baby salad greens",
         "1/2 cup frozen orange juice concentrate",
         "1/4 cup balsamic vinegar",
         "1/2 cup extra-virgin olive oil",
         "2 ounces goat cheese"
      ],
      "instructions": [
         "Place beets into a saucepan, and fill with enough water to cover. Bring to a boil, then cook for 20 to 30 minutes, until tender. Drain and cool, then cut in to cubes.",
         "While the beets are cooking, place the walnuts in a skillet over medium-low heat. Heat until warm and starting to toast, then stir in the maple syrup. Cook and stir until evenly coated, then remove from the heat and set aside to cool.",
         "In a small bowl, whisk together the orange juice concentrate, balsamic vinegar and olive oil to make the dressing.",
         "Place a large helping of baby greens onto each of four salad plates, divide candied walnuts equally and sprinkle over the greens. Place equal amounts of beets over the greens, and top with dabs of goat cheese. Drizzle each plate with some of the dressing."
      ],
      "ready": 40,
      "tags": [
         "fruits-and-vegetables"
      ]
   }
}